Revit 2027 API
HermiteSplineTangents.StartTangent Property
 The tangent vector at the start of the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ StartTangent { get; set; }
Public Property StartTangent As XYZ
	Get
	Set
public:
property XYZ^ StartTangent {
	XYZ^ get ();
	void set (XYZ^ value);
}
member StartTangent : XYZ with get, set
Property Value
XYZ
 This must be a nomalized unit vector.
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
ArgumentOutOfRangeException |  When setting this property: startTangent is not length 1.0.
InapplicableDataException |  The start tangent value is not set.
See Also
Reference
HermiteSplineTangents Class
Autodesk.Revit.DB Namespace